//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "نام کاربری یا رمز ورود اشتباه است";
"_cancelled_by_user"                    = "انتقال لغو شد";
"_error_folder_destiny_is_the_same_"    = "It is not possible to move the folder into itself";
"_error_not_permission_"                = "شما دسترسی مجاز برای انجام این عمل را ندارید";
"_error_path_"                          = "قادر به باز کردن این فایل یا پوشه نیست لطفا مطمئن شوید که آن وجود دارد";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "نام فایل دارای حداقل یک کاراکتر نامعتبر است";
"_not_connected_internet_"              = "خطای اتصال به سرور";
"_not_possible_connect_to_server_"      = "در این زمان امکان اتصال به سرور وجود ندارد";
"_not_possible_create_folder_"          = "پوشه نتوانست ایجاد شود";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "گذشت زمان بیش از اندازه, دوباره امتحان کنید";
"_unknow_response_server_"              = "پاسخ غیرمنتظره از سرور";
"_user_autentication_required_"         = "احراز هویت کاربر مورد نیاز است";
"_file_directory_locked_"               = "فایل یا دایرکتوری قفل شده است";
"_ssl_certificate_untrusted_"           = "حجم فایل معتبر نیست";
"_internal_server_"                     = "Internal server error";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "فایل منبع در مسیر مشخص شده یافت نشد";
"_folder_contents_nochanged_"           = "محتوای پوشه تغییر نکرده است";
"_images_invalid_converted_"            = "تصویر نامعتبر است و نمی تواند به یک تصویر کوچک تبدیل شود";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "سرور به طور موقت در دسترس نمیباشد";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "سهمیه ذخیره سازی شما تمام شده است";
"_ssl_connection_error_"                = " خطا در اتصال SSL، دوباره امتحان کنید";
"_bad_request_"                         = "Bad request";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


